app/controllers/users_controller.rb

  def create
    logger.info "++++++++++++inside the user controller++++++++++++++++"
    logger.info params.inspect

    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`age`, `created_at`, `name`, `stage`, `updated_at`) VALUES (40, '2014-03-03 08:42:30', 'Sachin', 'stand', '2014-03-03 08:42:30')